Revit 2027 API
PanelScheduleView.GetSectionData Method
 Gets section data that will be written to
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableSectionData GetSectionData(
	SectionType sectionType
)
Public Function GetSectionData (
	sectionType As SectionType
) As TableSectionData
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
member GetSectionData :
        sectionType : SectionType -> TableSectionData
Parameters
sectionType SectionType
 The section type
Return Value
TableSectionData
 The TableSectionData
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace